Louie56/TI-Cup-2025-E-Target-Tracking/m03507/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000



/* Defines for PWM */
#define PWM_INST                                                           TIMG6
#define PWM_INST_IRQHandler                                     TIMG6_IRQHandler
#define PWM_INST_INT_IRQN                                       (TIMG6_INT_IRQn)
#define PWM_INST_CLK_FREQ                                               32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_C0_PORT                                                   GPIOA
#define GPIO_PWM_C0_PIN                                           DL_GPIO_PIN_21
#define GPIO_PWM_C0_IOMUX                                        (IOMUX_PINCM46)
#define GPIO_PWM_C0_IOMUX_FUNC                       IOMUX_PINCM46_PF_TIMG6_CCP0
#define GPIO_PWM_C0_IDX                                      DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_C1_PORT                                                   GPIOA
#define GPIO_PWM_C1_PIN                                           DL_GPIO_PIN_22
#define GPIO_PWM_C1_IOMUX                                        (IOMUX_PINCM47)
#define GPIO_PWM_C1_IOMUX_FUNC                       IOMUX_PINCM47_PF_TIMG6_CCP1
#define GPIO_PWM_C1_IDX                                      DL_TIMER_CC_1_INDEX



/* Defines for TIMER_0 */
#define TIMER_0_INST                                                     (TIMG0)
#define TIMER_0_INST_IRQHandler                                 TIMG0_IRQHandler
#define TIMER_0_INST_INT_IRQN                                   (TIMG0_INT_IRQn)
#define TIMER_0_INST_LOAD_VALUE                                           (119U)
/* Defines for TIMER_1 */
#define TIMER_1_INST                                                     (TIMG8)
#define TIMER_1_INST_IRQHandler                                 TIMG8_IRQHandler
#define TIMER_1_INST_INT_IRQN                                   (TIMG8_INT_IRQn)
#define TIMER_1_INST_LOAD_VALUE                                           (119U)



/* Defines for UART_0 */
#define UART_0_INST                                                        UART0
#define UART_0_INST_FREQUENCY                                            4000000
#define UART_0_INST_IRQHandler                                  UART0_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART0_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_31
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_28
#define GPIO_UART_0_IOMUX_RX                                      (IOMUX_PINCM6)
#define GPIO_UART_0_IOMUX_TX                                      (IOMUX_PINCM3)
#define GPIO_UART_0_IOMUX_RX_FUNC                       IOMUX_PINCM6_PF_UART0_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                       IOMUX_PINCM3_PF_UART0_TX
#define UART_0_BAUD_RATE                                                  (9600)
#define UART_0_IBRD_4_MHZ_9600_BAUD                                         (26)
#define UART_0_FBRD_4_MHZ_9600_BAUD                                          (3)





/* Defines for ADC1 */
#define ADC1_INST                                                           ADC1
#define ADC1_INST_IRQHandler                                     ADC1_IRQHandler
#define ADC1_INST_INT_IRQN                                       (ADC1_INT_IRQn)
#define ADC1_ADCMEM_0                                         DL_ADC12_MEM_IDX_0
#define ADC1_ADCMEM_0_REF                        DL_ADC12_REFERENCE_VOLTAGE_VDDA
#define ADC1_ADCMEM_0_REF_VOLTAGE_V                                          3.3
#define GPIO_ADC1_C0_PORT                                                  GPIOA
#define GPIO_ADC1_C0_PIN                                          DL_GPIO_PIN_15



/* Port definition for Pin Group Motor */
#define Motor_PORT                                                       (GPIOB)

/* Defines for PIN_1: GPIOB.3 with pinCMx 16 on package pin 51 */
#define Motor_PIN_1_PIN                                          (DL_GPIO_PIN_3)
#define Motor_PIN_1_IOMUX                                        (IOMUX_PINCM16)
/* Port definition for Pin Group Beep */
#define Beep_PORT                                                        (GPIOA)

/* Defines for PIN_2: GPIOA.9 with pinCMx 20 on package pin 55 */
#define Beep_PIN_2_PIN                                           (DL_GPIO_PIN_9)
#define Beep_PIN_2_IOMUX                                         (IOMUX_PINCM20)
/* Port definition for Pin Group GPIO_GRP_2 */
#define GPIO_GRP_2_PORT                                                  (GPIOB)

/* Defines for PIN_3: GPIOB.6 with pinCMx 23 on package pin 58 */
#define GPIO_GRP_2_PIN_3_PIN                                     (DL_GPIO_PIN_6)
#define GPIO_GRP_2_PIN_3_IOMUX                                   (IOMUX_PINCM23)
/* Port definition for Pin Group KEYS */
#define KEYS_PORT                                                        (GPIOB)

/* Defines for PIN_0: GPIOB.8 with pinCMx 25 on package pin 60 */
#define KEYS_PIN_0_PIN                                           (DL_GPIO_PIN_8)
#define KEYS_PIN_0_IOMUX                                         (IOMUX_PINCM25)
/* Defines for KEY_1_PIN: GPIOB.9 with pinCMx 26 on package pin 61 */
#define KEYS_KEY_1_PIN_PIN                                       (DL_GPIO_PIN_9)
#define KEYS_KEY_1_PIN_IOMUX                                     (IOMUX_PINCM26)
/* Port definition for Pin Group MOTOR_A */
#define MOTOR_A_PORT                                                     (GPIOB)

/* Defines for AIN1: GPIOB.20 with pinCMx 48 on package pin 19 */
#define MOTOR_A_AIN1_PIN                                        (DL_GPIO_PIN_20)
#define MOTOR_A_AIN1_IOMUX                                       (IOMUX_PINCM48)
/* Defines for AIN2: GPIOB.24 with pinCMx 52 on package pin 23 */
#define MOTOR_A_AIN2_PIN                                        (DL_GPIO_PIN_24)
#define MOTOR_A_AIN2_IOMUX                                       (IOMUX_PINCM52)
/* Port definition for Pin Group MOTOR_B */
#define MOTOR_B_PORT                                                     (GPIOB)

/* Defines for BIN1: GPIOB.19 with pinCMx 45 on package pin 16 */
#define MOTOR_B_BIN1_PIN                                        (DL_GPIO_PIN_19)
#define MOTOR_B_BIN1_IOMUX                                       (IOMUX_PINCM45)
/* Defines for BIN2: GPIOB.18 with pinCMx 44 on package pin 15 */
#define MOTOR_B_BIN2_PIN                                        (DL_GPIO_PIN_18)
#define MOTOR_B_BIN2_IOMUX                                       (IOMUX_PINCM44)
/* Port definition for Pin Group Gray_Address */
#define Gray_Address_PORT                                                (GPIOA)

/* Defines for PIN0: GPIOA.17 with pinCMx 39 on package pin 10 */
#define Gray_Address_PIN0_PIN                                   (DL_GPIO_PIN_17)
#define Gray_Address_PIN0_IOMUX                                  (IOMUX_PINCM39)
/* Defines for PIN1: GPIOA.18 with pinCMx 40 on package pin 11 */
#define Gray_Address_PIN1_PIN                                   (DL_GPIO_PIN_18)
#define Gray_Address_PIN1_IOMUX                                  (IOMUX_PINCM40)
/* Defines for PIN2: GPIOA.14 with pinCMx 36 on package pin 7 */
#define Gray_Address_PIN2_PIN                                   (DL_GPIO_PIN_14)
#define Gray_Address_PIN2_IOMUX                                  (IOMUX_PINCM36)
/* Port definition for Pin Group ENCODERL */
#define ENCODERL_PORT                                                    (GPIOA)

/* Defines for A1side: GPIOA.27 with pinCMx 60 on package pin 31 */
// pins affected by this interrupt request:["A1side","B1side","B2side","A2side"]
#define ENCODERL_INT_IRQN                                       (GPIOA_INT_IRQn)
#define ENCODERL_INT_IIDX                       (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define ENCODERL_A1side_IIDX                                (DL_GPIO_IIDX_DIO27)
#define ENCODERL_A1side_PIN                                     (DL_GPIO_PIN_27)
#define ENCODERL_A1side_IOMUX                                    (IOMUX_PINCM60)
/* Defines for B1side: GPIOA.26 with pinCMx 59 on package pin 30 */
#define ENCODERL_B1side_IIDX                                (DL_GPIO_IIDX_DIO26)
#define ENCODERL_B1side_PIN                                     (DL_GPIO_PIN_26)
#define ENCODERL_B1side_IOMUX                                    (IOMUX_PINCM59)
/* Defines for B2side: GPIOA.25 with pinCMx 55 on package pin 26 */
#define ENCODERL_B2side_IIDX                                (DL_GPIO_IIDX_DIO25)
#define ENCODERL_B2side_PIN                                     (DL_GPIO_PIN_25)
#define ENCODERL_B2side_IOMUX                                    (IOMUX_PINCM55)
/* Defines for A2side: GPIOA.24 with pinCMx 54 on package pin 25 */
#define ENCODERL_A2side_IIDX                                (DL_GPIO_IIDX_DIO24)
#define ENCODERL_A2side_PIN                                     (DL_GPIO_PIN_24)
#define ENCODERL_A2side_IOMUX                                    (IOMUX_PINCM54)



/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_PWM_init(void);
void SYSCFG_DL_TIMER_0_init(void);
void SYSCFG_DL_TIMER_1_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_ADC1_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
